
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокНоменклатуры") Тогда
		Для Каждого СтрокаНоменклатуры Из Параметры.СписокНоменклатуры Цикл
			Если СтрокаНоменклатуры.Вес = 0 Тогда    
				ЗаполнитьЗначенияСвойств(СписокНоменклатуры.Добавить(), 
				СтрокаНоменклатуры);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаНоменклатуры = СписокНоменклатуры[ВыбраннаяСтрока];
	Номенклатура = СтрокаНоменклатуры.Номенклатура;
	
	ДопПараметры = новый Структура("ВыбраннаяСтрока", ВыбраннаяСтрока);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбновитьНоменклатуруПослеЗакрытия", 
	ЭтаФорма,ДопПараметры);
	ПараметрыФормы = Новый Структура("Ключ", Номенклатура);
	ПараметрыФормы.Вставить("ВесИспользовать", Истина);
	ПараметрыФормы.Вставить("ВесЧислитель", 777);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", 
	ПараметрыФормы, 
	ЭтаФорма,
	,,,
	ОписаниеОповещенияОЗакрытии);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНоменклатуруПослеЗакрытия(Результат, Параметры) Экспорт
	СтрокаНоменклатуры = СписокНоменклатуры[Параметры.ВыбраннаяСтрока]; 
	СтрокаНоменклатуры.Вес = ОбновитьВес(СтрокаНоменклатуры.Номенклатура);	
КонецПроцедуры


&НаСервере
Функция ОбновитьВес(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.ВесЧислитель * Номенклатура.ВесЗнаменатель КАК Вес
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Вес;
	Иначе Возврат 0;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьВесАвтоматически(Команда)
	Сч = 1;                   
	Макс = СписокНоменклатуры.Количество();
	Если Макс = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНоменклатуры Из СписокНоменклатуры Цикл    
		Число = ВытащитьЧисло(Строка(СтрокаНоменклатуры.Номенклатура));
		ЗаписатьВес(СтрокаНоменклатуры.Номенклатура, Число); 
		
		Заголовок = СтрШаблон("Выполяется обработка %1 из %2",Сч, Макс);
		ТекстСообщения = СтрШаблон("Нобенклатура: %1", СтрокаНоменклатуры.Номенклатура);
			
		Прогресс = 100 / Макс * Сч; 
		Состояние(Заголовок, Прогресс, ТекстСообщения);
		Сч = Сч + 1;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Функция ВытащитьЧисло(ИсходнаяСтрока)
	Результат = ""; 
	МассивЦифр = Новый Массив; 
	Сч = 0;
	Для Сч = 0 По 10 Цикл 
		МассивЦифр.Добавить(Строка(Сч));	
	КонецЦикла;
	
	Для Сч = 0 По СтрДлина(ИсходнаяСтрока) - 1 Цикл  
		Символ = Сред(ИсходнаяСтрока, Сч, 1);
		Если МассивЦифр.Найти(Символ) = Неопределено Тогда 	
			Продолжить;
		Иначе 
			Результат =  Результат + Символ;
		КонецЕсли;
	КонецЦикла;                   
	
	Результат = Число(Результат); 	
	Возврат ?(Результат < 100, Результат, Результат / 1000)
	
КонецФункции 

&НаСервере
Процедура ЗаписатьВес(Номенклатура, Число)

	 ОбъектНоменклатуры = Номенклатура.ПолучитьОбъект();
	 ОбъектНоменклатуры.ВесИспользовать = Истина;
	 ОбъектНоменклатуры.ВесЗнаменатель 	= 1;
	 ОбъектНоменклатуры.ВесЧислитель 		= Число;           
	 
	 ОбъектНоменклатуры.Записать();
	 
КонецПроцедуры 