
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокНоменклатуры") Тогда
		Для Каждого СтрокаНоменклатуры Из Параметры.СписокНоменклатуры Цикл
			Если СтрокаНоменклатуры.Вес = 0 Тогда    
				ЗаполнитьЗначенияСвойств(СписокНоменклатуры.Добавить(), 
					СтрокаНоменклатуры);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаНоменклатуры = СписокНоменклатуры[ВыбраннаяСтрока];
	Номенклатура = СтрокаНоменклатуры.Номенклатура;
	
	ДопПараметры = новый Структура("ВыбраннаяСтрока", ВыбраннаяСтрока);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбновитьНоменклатуруПослеЗакрытия", 
		ЭтаФорма,ДопПараметры);
	ПараметрыФормы = Новый Структура("Ключ", Номенклатура);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", 
		ПараметрыФормы, 
		ЭтаФорма,
		,,,
		ОписаниеОповещенияОЗакрытии);
	
		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНоменклатуруПослеЗакрытия(Результат, Параметры) Экспорт
	СтрокаНоменклатуры = СписокНоменклатуры[Параметры.ВыбраннаяСтрока]; 
	СтрокаНоменклатуры.Вес = ОбновитьВес(СтрокаНоменклатуры.Номенклатура);	
КонецПроцедуры


&НаСервере
Функция ОбновитьВес(Номенклатура)
  Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.ВесЧислитель * Номенклатура.ВесЗнаменатель КАК Вес
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Вес;
	Иначе Возврат 0;	
	КонецЕсли;

КонецФункции